### This jupyter notebook contains contents of the lesson "Arithmetic operators in Series and Dataframe"

**Author : Umidjon Sattorov. Machine Learning engineer**

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [4]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [7]:
s1.add(s2, fill_value= 8)

a     5.2
c     1.1
d    11.4
e     0.0
f    12.0
g    11.1
dtype: float64

Task : Create two series, one of which should contain integers and other one should contain boolean variables. Multiply first series to second one and return the result.

In [17]:
chips= pd.Series([6, 78, 45, 78, 54, 88, 34, 12], index=['s', 'd', 'e', 'ma', 'fe', 'r', 'w', 'q'])
chips

s      6
d     78
e     45
ma    78
fe    54
r     88
w     34
q     12
dtype: int64

In [21]:
hot= pd.Series([True, False, True, False, False, True, False, True ], index=['s', 'd', 'w', 'e', 'r', 'a', 'q', 't'])
hot

s     True
d    False
w     True
e    False
r    False
a     True
q    False
t     True
dtype: bool

In [22]:
chips*hot

a      NaN
d      0.0
e      0.0
fe     NaN
ma     NaN
q      0.0
r      0.0
s      6.0
t      NaN
w     34.0
dtype: object

In [25]:
chips.multiply(hot, fill_value= 1)

a      1.0
d      0.0
e      0.0
fe    54.0
ma    78.0
q      0.0
r      0.0
s      6.0
t      1.0
w     34.0
dtype: object

Task : Create two series, one of which should contain the names of people and the other one should contain surnames of them. Add them together.

____

In [45]:
df1 = pd.DataFrame(
    np.arange(9.).reshape(3, 3),          #arange=
    columns = list('bcd'),
    index = ['Apple', 'Pomegranate', 'Grapes'] 
)

df2 = pd.DataFrame(
    np.arange(12.).reshape(4, 3),
    columns = list('abc'),
    index = ['Apple', 'Pomegranate', 'Melon', 'Fig']
)
df1

               b    c    d
Apple        0.0  1.0  2.0
Pomegranate  3.0  4.0  5.0
Grapes       6.0  7.0  8.0

In [46]:
df2

               a     b     c
Apple        0.0   1.0   2.0
Pomegranate  3.0   4.0   5.0
Melon        6.0   7.0   8.0
Fig          9.0  10.0  11.0

In [35]:
df1+df2

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [36]:
df1-df2

              a    b    c   d
Apple       NaN -1.0 -1.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN -1.0 -1.0 NaN

In [37]:
# add() function
df1.add(df2)

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [38]:
# add() function with fill_value
df1.add(df2, fill_value = 0)

               a     b     c    d
Apple        0.0   1.0   3.0  2.0
Fig          9.0  10.0  11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon        6.0   7.0   8.0  NaN
Pomegranate  3.0   7.0   9.0  5.0

Other Arithmetic Operations
add, radd – Addition (+)

* sub, rsub – Subtraction (-)

* div, rdiv – Division (/)

* floordiv, rfloordiv – Floor division (//)

* mul, rmul – Multiplication (*)

* pow, rpow – Exponentiation (**)

All of the operations above support the fill_value parameter.

____

In [39]:
df1.sub(df2, fill_value= 0)

               a     b     c    d
Apple        0.0  -1.0  -1.0  2.0
Fig         -9.0 -10.0 -11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon       -6.0  -7.0  -8.0  NaN
Pomegranate -3.0  -1.0  -1.0  5.0

In [43]:
df1.div(df2, fill_value= 2)

                    a         b         c    d
Apple             inf  0.000000  0.500000  1.0
Fig          0.222222  0.200000  0.181818  NaN
Grapes            NaN  3.000000  3.500000  4.0
Melon        0.333333  0.285714  0.250000  NaN
Pomegranate  0.666667  0.750000  0.800000  2.5

In [47]:
df1.floordiv(df2, fill_value=  2)

               a    b    c    d
Apple        inf  0.0  0.0  1.0
Fig          0.0  0.0  0.0  NaN
Grapes       NaN  3.0  3.0  4.0
Melon        0.0  0.0  0.0  NaN
Pomegranate  0.0  0.0  0.0  2.0

In [48]:
df1.mul(df2, fill_value= 2)

                a     b     c     d
Apple         0.0   0.0   2.0   4.0
Fig          18.0  20.0  22.0   NaN
Grapes        NaN  12.0  14.0  16.0
Melon        12.0  14.0  16.0   NaN
Pomegranate   6.0  12.0  20.0  10.0

In [49]:
df1.pow(df2, fill_value=2)

                 a       b       c     d
Apple          1.0     0.0     1.0   4.0
Fig          512.0  1024.0  2048.0   NaN
Grapes         NaN    36.0    49.0  64.0
Melon         64.0   128.0   256.0   NaN
Pomegranate    8.0    81.0  1024.0  25.0